{"result":[{"min_version":"w","short_description":"Set a value for a question in a catalog item on a condition without scripting","roles":"3b0ec2f273311010b30e2ee2c4f6a7fe","sys_mod_count":"0","active":"true","servicenow_content":"false","sys_updated_on":"2023-11-22 04:35:20","sys_tags":"","title":"Set values for questions based on conditions","content":"<p>You can set values for questions in a catalog item without the need to script.</p>\n<p>The value you set for the question is displayed when the specified condition is met.</p>\n<p>For example, on a catalog item to order a company phone, you might want to automatically set the color to black if the storage size selected is 1 TB since that is the only option available. You can now configure this without the need to write any scripts.</p>","doc_resource":"https://docs.servicenow.com/csh?context=edit-question-cat-builder&version=latest","sys_id":"008b529b1cae3110f8771bcaa3c8ca52","sys_updated_by":"admin","sys_created_on":"2023-11-22 04:35:20","required_plugin":"{\"com.glideapp.servicecatalog\":\"1.0.0\"}","state":"published","sys_created_by":"admin"},{"min_version":"x","short_description":"Jumpstart your automation journey with a library of pre-built sample automations","roles":"6215cf76c3513010c573d833a840dd48","sys_mod_count":"4","active":"true","servicenow_content":"false","sys_updated_on":"2024-07-17 05:37:10","sys_tags":"","title":"Sample Automations","content":"<p>Use sample automations to jumpstart your automation journey with a library of pre-built automations in the RPA Desktop Design Studio.It covers a broad range of use cases across industries and business functions. Simply customize these pre-built automations to fit your specific needs, freeing up valuable development resources for more intricate tasks. For example, extracting data from a PDF and inserting it into an Excel file, report generation and distribution.</p>\n<p>Key benefits:</p>\n<ul><li>Speeds up automation development and boosts results.</li><li>Provides a range of sample automations catering to different use cases, <span class=\"ui-provider\">allowing you to explore different components and functionalities.</span></li><li>Integrates<strong> </strong>sample automations in your projects to reduce development time and effort.</li></ul>\n<p> </p>","doc_resource":"https://docs.servicenow.com/csh?topicname=use-sample-automation.html&version=latest","sys_id":"04aeaacfffe24210c664fe5f7c4fd94f","sys_updated_by":"admin","sys_created_on":"2024-06-07 07:30:51","required_plugin":"{\"sn_rpa_plugins\":\"10.0.0\"}","state":"published","sys_created_by":"admin"},{"min_version":"w","short_description":"Supporting multiple ServiceNow DevOps configurations in the same Jenkins setup, provides easier adoption and connection to various environments. ","roles":"","sys_mod_count":"1","active":"true","servicenow_content":"true","sys_updated_on":"2024-05-09 18:25:47","sys_tags":"","title":"Support for multiple ServiceNow DevOps configurations in one Jenkins server","content":"<p>You can now specify the service connection name or identifier uniquely for every ServiceNow DevOps configuration and use it in the pipeline where each of these connections will work independently. </p>","doc_resource":"","sys_id":"053faa611bce0290a54b0d81ec4bcbab","sys_updated_by":"admin","sys_created_on":"2024-05-08 19:10:21","required_plugin":"{\"com.sn_devops_chgvlcty\":\"4.0.0\"}","state":"published","sys_created_by":"admin"},{"min_version":"w","short_description":"Custom orchestration tool integration is now supported in DevOps Change Velocity. ","roles":"","sys_mod_count":"0","active":"true","servicenow_content":"true","sys_updated_on":"2024-05-08 18:45:49","sys_tags":"","title":"Create custom orchestration tool integration","content":"<p>If your organization uses an orchestration tool that isn’t provided in the base system, you have a framework that you can leverage to build the integration of orchestration tool on your own. This will enable you to connect, discover, configure webhooks, import historical data, receive live data, and enable change control on your pipelines. </p>","doc_resource":"https://support.servicenow.com/kb?id=kb_article_view&sysparm_article=KB1638410","sys_id":"0cf8a2651b8e0290a54b0d81ec4bcbc9","sys_updated_by":"admin","sys_created_on":"2024-05-08 18:45:49","required_plugin":"{\"com.sn_devops_chgvlcty\":\"4.0.0\"}","state":"published","sys_created_by":"admin"},{"min_version":"w","short_description":"Enable the override do not disturb feature to receive critical push notifications for ITSM Mobile Agent even when the phone is in do not disturb mode.","roles":"","sys_mod_count":"0","active":"true","servicenow_content":"true","sys_updated_on":"2024-05-08 19:31:46","sys_tags":"","title":"Enable the Override do not disturb to receive critical alerts.","content":"<div>\n<p>With the Override do not disturb to receive critical push notifications feature, ITSM managers can reach out to their on-call members even when their mobile devices are set to Do Not Disturb mode. </p>\n</div>\n<div>\n<p>By default, the following notifications are set as critical: </p>\n</div>\n<div>\n<ul><li>Major Incident Promotion Notification </li><li>Major Incident- ICA SLA Breached </li><li>Major Incident- ICT SLA Warning </li></ul>\n</div>\n<div>\n<p>You can also select and configure critical notification of your choice.</p>\n</div>","doc_resource":"https://docs.servicenow.com/bundle/washingtondc-it-service-management/page/product/itsm-mobile-agent/task/enable-override-do-not-disturb-to-receive-critical-alerts.html","sys_id":"0f32722d1bce0290a54b0d81ec4bcbb6","sys_updated_by":"admin","sys_created_on":"2024-05-08 19:31:46","required_plugin":"","state":"published","sys_created_by":"admin"},{"min_version":"w","short_description":" Set a field message for a question in a catalog item without scripting","roles":"3b0ec2f273311010b30e2ee2c4f6a7fe","sys_mod_count":"1","active":"true","servicenow_content":"false","sys_updated_on":"2023-11-22 04:27:51","sys_tags":"","title":"Set field messages on questions","content":"<p>You can set field messages for the questions in a catalog item without the need to script. Field messages appear below the question as helpful text when a specified condition is met.</p>\n<p>For example, you can set a warning message to display on the type of laptop question to read “Advanced laptop would need department head approval” when the type is chosen as “Advanced</p>","doc_resource":"https://docs.servicenow.com/csh?context=edit-question-cat-builder&version=latest","sys_id":"1169121b1cae3110f8771bcaa3c8ca3e","sys_updated_by":"admin","sys_created_on":"2023-11-22 04:27:31","required_plugin":"{\"com.glideapp.servicecatalog\":\"1.0.0\"}","state":"published","sys_created_by":"admin"},{"min_version":"w","short_description":"Create a catalog item in Catalog Builder using Now Assist, which uses the power of generative AI. ","roles":"3b0ec2f273311010b30e2ee2c4f6a7fe","sys_mod_count":"1","active":"true","servicenow_content":"true","sys_updated_on":"2024-05-09 05:57:02","sys_tags":"","title":"Generate catalog items using Now Assist","content":"<div>\n<p>The catalog generation using Now Assist streamlines catalog creation and helps inspire creativity. This feature empowers users to generate catalog items effortlessly by just describing them in natural language. Now Assist in Catalog Builder helps generate a complete catalog item with descriptions and question labels tailored to your needs. </p>\n</div>\n<div>\n<p>Provide specific details to describe your item to get the best results. Let’s take an example of creating a travel visa request form. You can provide detailed text input such as, &#34;I need you to create a travel visa request form. It must include a drop-down menu offering three travel types: Internal, External, and Customer visit (with Customer visit as the default option). Add mandatory fields for the travel start date, country of birth, and country traveling to. Include an optional field for the trip duration and business justification.” In this example, we’ve provided sufficient details for the visa form, including the questions. </p>\n</div>\n<div>\n<p>Based on this natural language input, Now Assist generates the catalog item along with questions with appropriate types that you can further review before publishing to your users</p>\n</div>","doc_resource":"https://docs.servicenow.com/?context=now-assist-for-catalog-generation&version=latest","sys_id":"12a18d391b8e4290a54b0d81ec4bcb8f","sys_updated_by":"admin","sys_created_on":"2024-05-09 05:54:34","required_plugin":"{\"com.snc.text2catalog\":\"\"}","state":"published","sys_created_by":"admin"},{"min_version":"w","short_description":"GitLab merge requests (pull requests) are now supported in DevOps Change Velocity, which collects merge requests data and tracks its corresponding pipeline executions.","roles":"","sys_mod_count":"0","active":"true","servicenow_content":"true","sys_updated_on":"2024-05-08 18:58:53","sys_tags":"","title":"GitLab merge request support","content":"<div>\n<p>You can track GitLab merge request (pull request) pipeline executions in ServiceNow DevOps Change Velocity, which goes through change acceleration before moving to production. </p>\n</div>\n<div>\n<p>GitLab merge requests meta data is collected in DevOps Change Velocity, which is linked with the change created for the merge request pipeline execution. This can be used in applying change policies, review, and approval</p>\n</div>","doc_resource":"","sys_id":"176caae91b8e0290a54b0d81ec4bcb82","sys_updated_by":"admin","sys_created_on":"2024-05-08 18:58:53","required_plugin":"{\"com.sn_devops_chgvlcty\":\"4.0.0\"}","state":"published","sys_created_by":"admin"},{"min_version":"w","short_description":"Get improved productivity from out latest updates to Incident records.","roles":"20803f15870033000e56d61e36cb0b7d","sys_mod_count":"0","active":"true","servicenow_content":"true","sys_updated_on":"2024-05-08 19:22:46","sys_tags":"","title":"Work better with Incidents","content":"<p>The Incident record is now enhanced to streamline your workflow, reduce efforts, help improve productivity and ensure a faster incidents resolution. You can quickly preview record information from the reference fields on the same page. Dive into focused points of interest for a caller by viewing the caller specific information. Copy and quickly share the incident record page URL with other agents. Incident record header information is now consolidated and moved to the Summary section to increase the workspace view screen.</p>","doc_resource":"","sys_id":"1d6faa611bce0290a54b0d81ec4bcbd3","sys_updated_by":"admin","sys_created_on":"2024-05-08 19:22:46","required_plugin":"{\"com.snc.uib.sow_itsm_container\":\"5.0.0\"}","state":"published","sys_created_by":"admin"},{"min_version":"w","short_description":"Leverage Playbooks for Major Incident Management to introduce structured workflows and automation to the overall Major Incident Management process  ","roles":"2831a114c611228501d4ea6c309d626d,8b88f99687480300b4ae6c5837cb0b08","sys_mod_count":"0","active":"true","servicenow_content":"true","sys_updated_on":"2024-05-08 19:33:51","sys_tags":"","title":"Playbooks for Major Incident Management","content":"<p>Playbooks provide process owners with a way to visualize business process workflows in a simple, task-oriented view. Now, playbooks are integrated into the Major Incident Management interface, that helps major incident managers to get visibility on items that require urgent attention. This integration also helps them leverage key automations like automatic creation of problem records.  </p>","doc_resource":"","sys_id":"2a44ba611b024290a54b0d81ec4bcb46","sys_updated_by":"admin","sys_created_on":"2024-05-08 19:33:51","required_plugin":"","state":"published","sys_created_by":"admin"},{"min_version":"v","short_description":"Understand the process metrics to evaluate the performance of Walk-up experience and Password Reset by leveraging out-of-the-box dashboards on Operational Success.","roles":"4f5d7db207303010c7d559bf1ad30096,553b1f166723220097eeff5557415a6a","sys_mod_count":"0","active":"true","servicenow_content":"true","sys_updated_on":"2024-05-08 19:50:53","sys_tags":"","title":"Walk-up experience and Password Reset operational dashboard","content":"<p>ServiceNow Operational Success dashboard is a set of prescribed KPIs, visualization, and dashboards to help you evaluate the health of the processes that you have defined for Walk-up and Password Reset applications. <br /> <br /><strong>Walk-up Experience</strong>: View the process metrics and distributions of Walk-up interactions. </p>\n<p><strong>Password Reset</strong>: View the process metrics for Password Reset. </p>\n<p> <br />These dashboards are built on ServiceNow Next Experience and will replace the existing ITSM Dashboards to give you a consolidated experience of tracking success across the board. These dashboards are intended to help you in assessing the metrics to get a deeper understanding of your day-to-day activities. Additionally, you would be able to edit and add KPIs/dashboard depending on your business processes.</p>","doc_resource":"https://docs.servicenow.com/bundle/washingtondc-it-service-management/page/product/itsm-success-dashboard/concept/admin-console-os.html","sys_id":"33083e2d1b024290a54b0d81ec4bcbcf","sys_updated_by":"admin","sys_created_on":"2024-05-08 19:50:53","required_plugin":"{\"sn_sd_itsm\":\"6.0.0\"}","state":"published","sys_created_by":"admin"},{"min_version":"w","short_description":"Build, review and publish post incident reports for Major Incidents in Service Operations Workspace  ","roles":"2831a114c611228501d4ea6c309d626d,8b88f99687480300b4ae6c5837cb0b08","sys_mod_count":"0","active":"true","servicenow_content":"true","sys_updated_on":"2024-05-08 19:34:41","sys_tags":"","title":"Post incident report for Major Incident Management in Service Operations Workspace ","content":"<p>Review the post incident report for a major incident to evaluate the incident response process and identify the process gaps for improvements. Reviewing the report helps you analyze the incident and to understand what can be done to avoid a similar incident or issue in the future. Post incident report is created automatically after a major incident is resolved. Use the Post incident report tab on a major incident record to generate, edit, review and publish the report in PDF.</p>","doc_resource":"","sys_id":"40c4ba611b024290a54b0d81ec4bcb4c","sys_updated_by":"admin","sys_created_on":"2024-05-08 19:34:41","required_plugin":"","state":"published","sys_created_by":"admin"},{"min_version":"w","short_description":"JFrog Artifactory integration with GitHub Action Workflows, Azure DevOps, and GitLab pipelines is now supported in DevOps Change Velocity, along with Jenkins support in earlier releases.","roles":"","sys_mod_count":"0","active":"true","servicenow_content":"true","sys_updated_on":"2024-05-08 19:03:03","sys_tags":"","title":"Support JFrog Artifactory for GitHub Actions, Azure DevOps, and GitLab","content":"<div>\n<p>For GitHub Actions, Azure DevOps, and GitLab, you can import the artifact data published to JFrog Artifactory for the corresponding pipeline executions. The data can then be linked with all the DevOps data collected in DevOps Change Velocity, like Work Items, Commits, Quality Summary, Test Runs, and so on, which helps to trace and identify the root causes. </p>\n</div>\n<div>\n<p>With this, you can also onboard easily to DevOps Change Velocity, without having to modify the pipelines with ServiceNow DevOps extensions and tasks.</p>\n</div>","doc_resource":"","sys_id":"557da26d1b8e0290a54b0d81ec4bcbbd","sys_updated_by":"admin","sys_created_on":"2024-05-08 19:03:03","required_plugin":"{\"com.sn_devops_chgvlcty\":\"4.0.0\"}","state":"published","sys_created_by":"admin"},{"min_version":"w","short_description":"Jira Cloud integration is now supported in DevOps Change Velocity along with existing support for Jira on-prem. ","roles":"","sys_mod_count":"0","active":"true","servicenow_content":"true","sys_updated_on":"2024-05-08 19:05:04","sys_tags":"","title":"Jira Cloud support","content":"<div>\n<p>Jira Cloud integration is now supported in DevOps Change Velocity. </p>\n</div>\n<div>\n<p>Jira Issues are tracked for the configured projects and associated with the corresponding commits, using the commit messages containing the Jira Issues Id in the standard format.</p>\n</div>","doc_resource":"","sys_id":"56fd226d1b8e0290a54b0d81ec4bcbc3","sys_updated_by":"admin","sys_created_on":"2024-05-08 19:05:04","required_plugin":"{\"com.sn_devops_chgvlcty\":\"4.0.0\"}","state":"published","sys_created_by":"admin"},{"min_version":"x","short_description":"Override a skill version in RPA Hub to utilize a specific skill package version for your bot process","roles":"18eb1f40c3793010c573d833a840ddd2,51b71701c3613010c573d833a840dd68","sys_mod_count":"7","active":"true","servicenow_content":"false","sys_updated_on":"2024-07-17 05:37:16","sys_tags":"","title":"Skill Enhancements","content":"<p>View a skill package version for an associated package in a bot process or an attended and an unattended packages. As an RPA release manager, override a skill version in RPA Hub to use a specific skill package version for your bot process. You can use different versions of the same skill for different bot processes based on your specific requirements, offering greater customization and flexibility. When the bot process executes, it uses the selected version instead of the version defined in the automation.</p>\n<p>For example, the Excel operation skill has two versions, 10001 and 10002 having different updates. With the help of this feature, the Shipping Management bot process can now use the version 1001 and the Data Reconciliation bot process can use the version 10002 of the same skill without publishing the package or bot process again.</p>\n<p>Key benefits:</p>\n<ul><li>Allows you to use the specific skill version of a bot process, reducing the effort of publishing the package again from RPA Desktop Design  Studio and avoiding unnecessary changes.</li><li>Each bot process can rely on a specific version of a skill, ensuring consistent and predictable behavior.</li><li>Enables you to maintain your automation processes more effectively.</li></ul>\n<p> </p>","doc_resource":"https://docs.servicenow.com/csh?topicname=override-skill-version-rpahub.html&version=latest","sys_id":"5d47760bff264210c664fe5f7c4fd9f2","sys_updated_by":"admin","sys_created_on":"2024-06-07 08:10:27","required_plugin":"{\"sn_rpa_fdn\":\"10.0.0\"}","state":"published","sys_created_by":"admin"},{"min_version":"x","short_description":"In a single-click, migrate the bot process and associated assets from one instance to another instance.","roles":"18eb1f40c3793010c573d833a840ddd2,51b71701c3613010c573d833a840dd68,6215cf76c3513010c573d833a840dd48","sys_mod_count":"6","active":"true","servicenow_content":"false","sys_updated_on":"2024-07-17 05:37:21","sys_tags":"","title":"Promote RPA assets to higher environment","content":"<p>Migrate the bot process configuration and associated assets from one environment to another environment. For example, when the bot process is ready for migration from a developer’s environment to a UAT environment, RPA developers or RPA admins can select the <strong>Ready for Migration</strong> button on a published bot process. This action activates the <strong>Migrate</strong> button, which is only visible to the RPA release manager or RPA admin on the same bot process. Then, the RPA release manager or RPA admin can initiate the migration process by selecting the <strong>Migrate</strong> button. After the bot process and associated assets are migrated, the release manager can make the necessary changes and publish the bot process on the UAT (target) environment.</p>\n<p>Key benefits:</p>\n<ul><li>Single-click migration from a lower environment to a higher environment.</li><li>Ensures smoother transitions and efficient utilization of resources.</li><li>Helps ensure higher quality and reliable deployments.</li></ul>\n<p> </p>","doc_resource":"https://docs.servicenow.com/csh?topicname=bot-process-migration.html&version=latest","sys_id":"717d6a8fffe24210c664fe5f7c4fd96f","sys_updated_by":"admin","sys_created_on":"2024-06-07 07:26:15","required_plugin":"{\"sn_rpa_fdn\":\"10.0.0\"}","state":"published","sys_created_by":"admin"},{"min_version":"v","short_description":"Leverage the admin experience to configure and customize Success Dashboard, Operational Success, and Benchmarks dashboard.","roles":"4f5d7db207303010c7d559bf1ad30096,553b1f166723220097eeff5557415a6a","sys_mod_count":"0","active":"true","servicenow_content":"true","sys_updated_on":"2024-05-08 19:45:26","sys_tags":"","title":"Success Dashboard Admin Console","content":"<p>Use the ITSM Success dashboard Admin console to perform the basic configuration of Success dashboard that enables you to track the success of the product. It displays all the admin-specific work at a glance and tasks that need attention including installation of the related application and configuration settings.</p>","doc_resource":"https://docs.servicenow.com/bundle/washingtondc-it-service-management/page/product/itsm-success-dashboard/concept/getting-started-sd-admin-console.html","sys_id":"75c576251b024290a54b0d81ec4bcb42","sys_updated_by":"admin","sys_created_on":"2024-05-08 19:45:26","required_plugin":"{\"sn_sd_itsm\":\"6.0.0\"}","state":"published","sys_created_by":"admin"},{"min_version":"v","short_description":"Manage notification preferences, delivery channels, escalation trigger rules, and policies for a group. ","roles":"4049ed920a0a2c96278c788f392121aa,40496e710a0a2c965a8eca13b7e1dcd3","sys_mod_count":"0","active":"true","servicenow_content":"true","sys_updated_on":"2024-05-09 05:44:46","sys_tags":"","title":"Create and edit trigger rules and policies","content":"<div>\n<p>As a shift manager, manage notification preferences, delivery channels, escalation trigger rules, and policies for your group. </p>\n</div>\n<div>\n<p>As an on-call admin, manage notification preferences, delivery channels, escalation trigger rules, and policies for any group. </p>\n</div>","doc_resource":"https://docs.servicenow.com/bundle/washingtondc-it-service-management/page/product/service-operations-workspace/concept/work-on-escalation-trigger-rules-and-policies-in-sow.html","sys_id":"8f4009f51b8e4290a54b0d81ec4bcbc4","sys_updated_by":"admin","sys_created_on":"2024-05-09 05:44:46","required_plugin":"{\"sn_snow_on_call\":\"4.2\"}","state":"published","sys_created_by":"admin"},{"min_version":"w","short_description":"Track all key metrics including Walk-Up Experience metrics seamlessly on the Operational Dashboard ","roles":"0434e1783b1013001d132c2b54efc4d3,e905e5783b1013001d132c2b54efc4cf","sys_mod_count":"1","active":"true","servicenow_content":"true","sys_updated_on":"2024-05-09 07:30:21","sys_tags":"","title":"View all your metrics at one place – Operational dashboard","content":"<p>Moving all walk-up metrics to the Next Experience operational dashboard creates a one-stop shop for IT data. This empowers Admins, Managers, and IT Process Owners with a quick and standardized view to access dashboards seamlessly and help make data-driven decisions.</p>","doc_resource":"","sys_id":"92c936a11b424290a54b0d81ec4bcb4b","sys_updated_by":"admin","sys_created_on":"2024-05-08 19:58:26","required_plugin":"{\"com.snc.walkup\":\"\"}","state":"published","sys_created_by":"admin"},{"min_version":"v","short_description":"Define a preferred notification methods and delivery channels for receiving alerts whenever an escalation ticket is raised. ","roles":"282bf1fac6112285017366cb5f867469,4049ed920a0a2c96278c788f392121aa,40496e710a0a2c965a8eca13b7e1dcd3","sys_mod_count":"0","active":"true","servicenow_content":"true","sys_updated_on":"2024-05-09 05:46:42","sys_tags":"","title":"Set notification preferences as an individual or for an entire team.","content":"<div>\n<p>As an agent, set your preferred notification channels. </p>\n</div>\n<div>\n<p>As a shift manager, manage notification preferences and delivery channels for your group. </p>\n</div>\n<div>\n<p>As an on-call admin, manage notification preferences and delivery channels for any group. </p>\n</div>","doc_resource":"https://docs.servicenow.com/bundle/washingtondc-it-service-management/page/product/service-operations-workspace/concept/create-notification-preference-rule.html","sys_id":"95a009f51b8e4290a54b0d81ec4bcb64","sys_updated_by":"admin","sys_created_on":"2024-05-09 05:46:42","required_plugin":"{\"sn_snow_on_call\":\"4.2\"}","state":"published","sys_created_by":"admin"},{"min_version":"w","short_description":"View the health of an impacted device from within Service Operations Workspace","roles":"282bf1fac6112285017366cb5f867469","sys_mod_count":"0","active":"true","servicenow_content":"true","sys_updated_on":"2024-05-08 19:37:46","sys_tags":"","title":"DEX device health link for service desk agents ","content":"<div>\n<p>DEX provides an overview of a device’s health including device and application performance.  </p>\n</div>\n<div>\n<p>As a service desk agent, you can navigate to the DEX device health page from computer CI record in SOW experience if the DEX agent is installed on the computer CI. This helps you analyze the device&#39;s metrics from within the platform, offering valuable insights for effective issue investigation.</p>\n</div>","doc_resource":"","sys_id":"a2457a251b024290a54b0d81ec4bcb34","sys_updated_by":"admin","sys_created_on":"2024-05-08 19:37:46","required_plugin":"{\"com.sn_dex_content_playbook\":\"2.2\",\"com.sn_dex\":\"2.2\"}","state":"published","sys_created_by":"admin"},{"min_version":"w","short_description":"Initiate an automation seamlessly from ServiceNow forms in an attended mode","roles":"d83f4517778001104a5cfdf5ec5a9997","sys_mod_count":"9","active":"true","servicenow_content":"false","sys_updated_on":"2024-07-18 10:08:11","sys_tags":"","title":"Embedded Task Automation","content":"<p>With the embedded task automation feature, trigger attended bot processes (attended automations) from the classic or Core UI (UI 16) experience of the ServiceNow forms, apart from initiating them from the Attended Robot application. <span class=\"normaltextrun\">This feature enables a UI action on the form, uses form fields as inputs to automation, and updates form fields during the automation execution.</span></p>\n<p>Key benefits:</p>\n<ul><li>Automatic data transfer on a click of a button</li><li>Enables the reuse of the existing ServiceNow form without a need to develop forms within automation.</li><li>Initiates automations without leaving the ServiceNow interface, reducing the time spent switching between applications. </li></ul>\n<p>Configuring Embedded Task Automation</p>\n<p>To configure the embedded task automation, see <a title=\"Use this list of steps to guide you through all the tasks for configuring an embedded task automation.\" href=\"https://docs.servicenow.com/bundle/washingtondc-integrate-applications/page/product/rpa-hub/reference/list-steps-eta-rpa.html\">List of steps for configuring embedded task automation</a>.</p>\n<p> </p>","doc_resource":"https://docs.servicenow.com/bundle/washingtondc-integrate-applications/page/product/rpa-hub/concept/embedded-task-auto-rpa.html","sys_id":"ad1a71a0ffaa421018ddfe258c4fd9a7","sys_updated_by":"karthik.macherla@snc","sys_created_on":"2024-05-30 09:31:28","required_plugin":"{\"sn_rpa_fdn\":\"8.0.0\"}","state":"published","sys_created_by":"admin"},{"min_version":"v","short_description":"Take advantage of prescribed set of KPIs and dashboards to assess the performance of processes defined by you for different ITSM workflows like Incident, Problem, Change, Requested Items, etc.","roles":"4f5d7db207303010c7d559bf1ad30096,553b1f166723220097eeff5557415a6a,20803f15870033000e56d61e36cb0b7d,ceb92b8153c833004558ddeeff7b12df,d8e675e8532323008ef67c2c0fc587f6,0d6c490a3b2010108ed00d8044efc40e","sys_mod_count":"2","active":"true","servicenow_content":"false","sys_updated_on":"2023-12-06 07:55:21","sys_tags":"","title":"Operational Success dashboard","content":"<p>ServiceNow Operational Success dashboard is a set of prescribed KPIs, visualization and dashboards to help you evaluate the health of the processes that you have defined for Incidents, Major Incidents, Requested Items, Problem, Change, On-call, and Service Catalog. These dashboards are built on ServiceNow Next Experience and will replace the existing ITSM Dashboards to give you a consolidated experience of tracking success across the board. These dashboards are intended to help you in assessing the metrics to get a deeper understanding of your day-to-day activities. Additionally, you would be able to edit and add KPIs/dashboard depending on your business processes. View the list of dashboards that will be deprecated by navigating to documentation.</p>","doc_resource":"/api/now/v1/context_doc_url/itsm_success_dashboard","sys_id":"af5bb0e7533231104bdeddeeff7b121e","sys_updated_by":"admin","sys_created_on":"2023-12-05 02:30:17","required_plugin":"{\"sn_sd_itsm\":\"5.2\"}","state":"published","sys_created_by":"admin"},{"min_version":"v","short_description":"As an agent, view your schedule, the schedules of your peers, request an absence, propose shift coverage, and set your notification preferences. ","roles":"282bf1fac6112285017366cb5f867469,4049ed920a0a2c96278c788f392121aa","sys_mod_count":"0","active":"true","servicenow_content":"true","sys_updated_on":"2024-05-09 05:43:15","sys_tags":"","title":"View shifts and request time-off","content":"<p>Request an absence, provide coverage for a shift, and request overtime for a shift. Managing your work helps shift managers and on-call admins plan shifts and confirm that members are available to always respond to incidents and escalations. </p>","doc_resource":"https://docs.servicenow.com/bundle/washingtondc-it-service-management/page/product/service-operations-workspace/concept/work-on-a-schedule-in-sow.html","sys_id":"bd3eb4351b8e4290a54b0d81ec4bcb21","sys_updated_by":"admin","sys_created_on":"2024-05-09 05:43:15","required_plugin":"{\"sn_snow_on_call\":\"4.2\"}","state":"published","sys_created_by":"admin"},{"min_version":"v","short_description":"Take advantage of the new Benchmarks dashboard to enhance your experience.","roles":"4f5d7db207303010c7d559bf1ad30096,553b1f166723220097eeff5557415a6a","sys_mod_count":"3","active":"true","servicenow_content":"false","sys_updated_on":"2023-12-28 08:23:06","sys_tags":"","title":"Next experience Benchmarks dashboard","content":"<p><span class=\"ph\">The ServiceNow Benchmarks application gives you instant visibility into your key performance indicators (KPIs) and trends, as well as comparative insight relative to industry averages of your peers and to the industry top performers. You can compare the performance of your organization with recognized industry standards, view a side-by-side comparison of performance with global benchmarks, to drive improvement opportunities at your organization.</span></p>","doc_resource":"api/now/v1/context_doc_url/c_NewuiDashboard","sys_id":"c41c656f53b231104bdeddeeff7b12f0","sys_updated_by":"admin","sys_created_on":"2023-12-05 06:01:23","required_plugin":"{\"sn_benchmarks\":\"1.1\"}","state":"published","sys_created_by":"admin"},{"min_version":"v","short_description":"Manage On-call shifts by accepting or rejecting time-off requests. Resolve gaps and conflicts by providing coverage and extra time. ","roles":"40496e710a0a2c965a8eca13b7e1dcd3,4049ed920a0a2c96278c788f392121aa","sys_mod_count":"0","active":"true","servicenow_content":"true","sys_updated_on":"2024-05-09 05:48:11","sys_tags":"","title":"Create and edit an on-call shift using the Schedule menu or the Teams menu in Service Operations Workspace. ","content":"<p>As a shift manager, view and manage shifts, approve or reject absence requests, and resolve gaps and conflicts for your group. <br />As an On-call Admin, you can manage shifts for all the groups. </p>","doc_resource":"https://docs.servicenow.com/bundle/washingtondc-it-service-management/page/product/service-operations-workspace/concept/manage-shifts-in-service-operation-workspace.html","sys_id":"d7018d391b8e4290a54b0d81ec4bcb87","sys_updated_by":"admin","sys_created_on":"2024-05-09 05:48:11","required_plugin":"{\"sn_snow_on_call\":\"4.2\"}","state":"published","sys_created_by":"admin"},{"min_version":"u","short_description":"Configure a question to auto-populate values based on another question on the catalog item.","roles":"3b0ec2f273311010b30e2ee2c4f6a7fe","sys_mod_count":"1","active":"true","servicenow_content":"false","sys_updated_on":"2023-11-22 04:43:29","sys_tags":"","title":"Set up questions to populate values automatically","content":"<p>While setting up a question, configure a value to populate automatically whenever the value of another question of the reference type changes. For example, in a catalog item, you can set up the value of “Name of the manager” question to auto-populate whenever the value of the “Select the requester” question changes.</p>\n<p>The value of the dependent question is auto-populated when the value of the initial question is selected or changed.</p>","doc_resource":"https://docs.servicenow.com/csh?context=create-question-cat-builder&version=latest","sys_id":"ddac5a1f1cae3110f8771bcaa3c8cacf","sys_updated_by":"admin","sys_created_on":"2023-11-22 04:39:42","required_plugin":"{\"com.glideapp.servicecatalog\":\"1.0.0\"}","state":"published","sys_created_by":"admin"},{"min_version":"w","short_description":"Task Communications Management enables agents to send out communications to required stakeholders and end users using different channels.  ","roles":"2831a114c611228501d4ea6c309d626d,c23366ebdcac010059921d929b232e98,8b88f99687480300b4ae6c5837cb0b08","sys_mod_count":"0","active":"true","servicenow_content":"true","sys_updated_on":"2024-05-08 19:35:43","sys_tags":"","title":"Task Communications Management in Service Operations Workspace","content":"<p>Task Communications Management helps you to streamline communications by creating designated communication plans and tasks for effective communications with the required stakeholders during an ongoing major incident event. Leverage the framework to help notify users about important updates that require attention. </p>","doc_resource":"","sys_id":"e1f4bae11b024290a54b0d81ec4bcb58","sys_updated_by":"admin","sys_created_on":"2024-05-08 19:35:43","required_plugin":"","state":"published","sys_created_by":"admin"},{"min_version":"x","short_description":"Increase reusability and ease of use of credentials","roles":"18eb1f40c3793010c573d833a840ddd2,51b71701c3613010c573d833a840dd68","sys_mod_count":"10","active":"true","servicenow_content":"false","sys_updated_on":"2024-07-17 05:37:28","sys_tags":"","title":"Centralized Credential Management","content":"<p><span class=\"ui-provider\">Introducing a centralized credential management system to allow users to define credentials once and reuse them across relevant bot processes. This feature eliminates the need for redundant credential creation whilst improving overall efficiency and reducing risks associated with credential management.</span></p>\n<ul><li>Ensures increased reusability and ease of use of credentials.</li><li>Eliminates the need of creating and managing the same credentials separately for each bot process, leading to improved efficiency of resources.</li><li>Streamlines management of credentials for multiple bot processes.</li><li>Ensures stringent security as it restricts credentials access to authorized users only.</li></ul>","doc_resource":"https://docs.servicenow.com/csh?topicname=credential-management-rpa-hub.html&version=latest","sys_id":"e4552e47ffe24210c664fe5f7c4fd9de","sys_updated_by":"admin","sys_created_on":"2024-06-07 06:48:43","required_plugin":"{\"sn_rpa_fdn\":\"10.0.0\"}","state":"published","sys_created_by":"admin"},{"min_version":"v","short_description":"Create and edit an on-call shift using the Schedule menu or the Teams menu in Service Operations Workspace.","roles":"4049ed920a0a2c96278c788f392121aa","sys_mod_count":"0","active":"true","servicenow_content":"true","sys_updated_on":"2024-05-09 05:34:22","sys_tags":"","title":"Create and edit on-call shifts in Service Operations Workspace ","content":"<p>As a shift manager, view and manage shifts, approve or reject absence requests, and resolve gaps and conflicts. You can also manage notification preferences, delivery channels, escalation trigger rules, and policies for your group.</p>","doc_resource":"https://docs.servicenow.com/bundle/washingtondc-it-service-management/page/product/service-operations-workspace/concept/create-a-schedule-in-sow.html","sys_id":"e86df0f11b8e4290a54b0d81ec4bcb47","sys_updated_by":"admin","sys_created_on":"2024-05-09 05:34:22","required_plugin":"{\"sn_snow_on_call\":\"4.2\"}","state":"published","sys_created_by":"admin"},{"min_version":"u","short_description":"Let your catalog editors create catalog items in a specific scope or an application without giving them a developer access to the application.","roles":"e09d16f2c0a8016501281264b989e1db","sys_mod_count":"0","active":"true","servicenow_content":"false","sys_updated_on":"2023-11-22 04:45:25","sys_tags":"","title":"Catalog item scope management","content":"<p>Let your catalog builder editors create catalog items in a specific scope or an application without giving them the developer access to the application.</p>\n<p>While creating a catalog item template, you can determine whether the catalog builder editors can create catalog items in the same scope of the template you’re creating.</p>\n<p>In such case, the catalog items which are created using this template would be created in the scope of the template.</p>\n<p>For example, suppose the template is in Application A, and you have enabled the scope in the template. Now, when a catalog builder editor uses this template to create a catalog item, the catalog item will be created as a part of the Application A.</p>\n<p>That means, the catalog builder editor or business owner doesn’t need the developer access to the Application A to create standard catalog items or record producers in that application.</p>","doc_resource":"https://docs.servicenow.com/csh?context=create-cat-item-template-cat-builder&version=latest","sys_id":"eded525f1cae3110f8771bcaa3c8ca05","sys_updated_by":"admin","sys_created_on":"2023-11-22 04:45:25","required_plugin":"{\"com.glideapp.servicecatalog\":\"1.0.0\"}","state":"published","sys_created_by":"admin"}]}